Revit 2027 API
ParameterTypeId.ViewerIsReference Property
 "Is a Reference"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewerIsReference { get; }
Public Shared ReadOnly Property ViewerIsReference As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewerIsReference {
	ForgeTypeId^ get ();
}
static member ViewerIsReference : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace